Check

** BG-11 Solution
   Prices from alfa.com
   |   | Need? | Purpose | Component                 |    Final (M) |      MW | Total Amount (g/day) |    Price Per ($/g) |   Total $ |
   |---+-------+---------+---------------------------+--------------+---------+----------------------+--------------------+-----------|
   | ! |       |         | Fe Citrate solution       |              |         |                      |                    |           |
   | # | ?     |         | Citric acid (monohydrate) |    0.0000312 |  210.14 |            131127.36 |              0.256 | 33568.604 |
   | # | ?     |         | NaNO3                     |       0.0176 | 84.9947 |            29918134. |             0.0177 | 529550.97 |
   | # | ?     |         | K2HPO4                    |     0.000224 |   174.2 |              780416. |              0.756 | 589994.50 |
   | # | ?     |         | MgSO4 * 7H2O              |     0.000304 |  246.47 |            1498537.6 |             0.4545 | 681085.34 |
   | # | ?     |         | CaCl2 * 2H2O              |     0.000184 | 147.014 |            541011.52 |             0.0445 | 24075.013 |
   | # | ?     |         | Na2CO3 (monohydrate)      |     0.000189 |  124.00 |              468720. |             0.0102 |  4780.944 |
   | # | ?     |         | Na2SiO3 * 5H2O            |     0.000204 |  212.14 |             865531.2 |            0.00192 | 1661.8199 |
   | ! |       |         | Trace Metals Soln         |              |         |                      |                    |           |
   | # | ?     |         | MgNa2EDTA * 3H2O          |   0.00000226 |  372.24 |            16825.248 |              0.477 | 8025.6433 |
   | # | ?     |         | H3BO3                     |    0.0000463 |   61.83 |             57254.58 |             0.0126 | 721.40771 |
   | # | ?     |         | MgSO4 * 7H2O              |    0.0000101 |  246.47 |             49786.94 |             0.0161 | 801.56973 |
   | # | ?     |         | ZnSO4 * 7H2O              |  0.000000765 |  287.53 |             4399.209 |              0.844 | 3712.9324 |
   | # | ?     |         | CuSO4 * 5H2O              |   0.00000316 |   2.284 |             144.3488 |              0.369 | 53.264707 |
   | # | ?     |         | Na2MoO4 * 2H2O            | 0.0000000868 |  241.95 |             420.0252 |              1.726 | 724.96350 |
   | # | ?     |         | Co(NO3)2 * 6H2O           |  0.000000170 |  291.03 |              989.502 |             0.1214 | 120.12554 |
   |---+-------+---------+---------------------------+--------------+---------+----------------------+--------------------+-----------|
   | # |       |         |                           |              |         |            34333298. |      Total (Daily) | 1878877.1 |
   | # |       |         |                           |              |         |                    0 | (Yearly, millions) | 686.16592 |
#+TBLFM: $7=$5*$6*20000000::$9=$7*$8::@18$7=vsum(@2$7..@17$7)::@18$9=vsum(@2$9..@17$9)::@19$9=@18$9*365.2/1000000

